№1.3
x = 5 >= 2
A = {1, 3, 7, 8}
B = {2, 4, 5, 10, 'apple'}
C = A & B

df = ['Антонова Антонина', 34, 'ж']
z = 'type'  # Строка z
D = [1, 'title', 2, 'content']

print("x:", x, "Тип:", type(x))
print("A:", A, "Тип:", type(A))
print("B:", B, "Тип:", type(B))
print("C:", C, "Тип:", type(C))
print("df:", df, "Тип:", type(df))
print("z:", z, "Тип:", type(z))
print("D:", D, "Тип:", type(D))
Ответ:
x: True Тип: <class 'bool'>
A: {8, 1, 3, 7} Тип: <class 'set'>
B: {2, 4, 5, 10, 'apple'} Тип: <class 'set'>
C: set() Тип: <class 'set'>
df: ['Антонова Антонина', 34, 'ж'] Тип: <class 'list'>
z: type Тип: <class 'str'>
D: [1, 'title', 2, 'content'] Тип: <class 'list'>

№2.3
x = float(input("Введите значение x: "))

if x < -5:
    print("x принадлежит интервалу (-∞, -5)")
elif -5 <= x <= 5:
    print("x принадлежит интервалу [-5, 5]")
else:
    print("x принадлежит интервалу (5, +∞)")
  ответ:
Введите значение x: 3
x принадлежит интервалу [-5, 5]


№3.31
x = 10
while x >= 1:
    print(x)
    x -= 3

ответ:
10
7
4
1
№3.32
characteristics = [
    "Возраст",
    "Пол",
    "Рост",
    "Вес",
    "Цвет волос",
    "Цвет глаз",
    "Уровень образования",
    "Профессия",
    "Место проживания",
    "Хобби",
    "Семейное положение",
    "Национальность",
    "Язык общения",
    "Здоровье",
    "Социальный статус"
]

# Вывод списка на экран
for characteristic in characteristics:
    print(characteristic)


ответ:
Возраст
Пол
Рост
Вес
Цвет волос
Цвет глаз
Уровень образования
Профессия
Место проживания
Хобби
Семейное положение
Национальность
Язык общения
Здоровье
Социальный статус




№3.33
x = 2
while x <= 15:
    print(x)
    x += 1


ответ:
2
3
4
5
6
7
8
9
10
11
12
13
14
15


№3.34
for i in range(106, 5, -25):
    print(i)

ответ:
106
81
56
31
6


№4.31:


